In [1]:
# import pandas as pd 

import pandas as pd 

  
# list of strings 

lst = ['Geeks', 'For', 'Geeks', 'is',  

            'portal', 'for', 'Geeks'] 

  
# Calling DataFrame constructor on list 

df = pd.DataFrame(lst) 
df

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [2]:
lst = [['tom', 25], ['krish', 30], 

       ['nick', 26], ['juli', 22]] 

    

df = pd.DataFrame(lst, columns =['Name', 'Age']) 
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [4]:
df = pd.DataFrame(columns=['A'])
for i in range(5):
    df = df.append({'A': i}, ignore_index=True)
df

   A
0  0
1  1
2  2
3  3
4  4

In [5]:
pd.concat([pd.DataFrame([i], columns=['A']) for i in range(5)],ignore_index=True)

   A
0  0
1  1
2  2
3  3
4  4